{
  "author": "Jeffrey R. Holland",
  "title": "Be Ye Therefore Perfect -Eventually",
  "subtitle": "Of the Quorom of the Twelve Apostles",
  "images": [
    {
      "title": "A Scenic View",
      "caption": "This is a picture of a barn with a nice background of mountains and stuff.",
      "imageurl": "https://images.unsplash.com/photo-1510858391029-ccbdd9fe164e?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=0e5f3c2fa1a5394b2687460db2fc49ab&auto=format&fit=crop&w=889&q=80"
    },
    {
      "title": "A Cathedral",
      "caption": "This is a picture of a cathedral of some sort or another",
      "imageurl": "https://images.unsplash.com/photo-1467383670897-225b16e3cc9a?ixlib=rb-0.3.5&s=02746cbdc6038781ea49289f23920a9d&auto=format&fit=crop&w=667&q=80"
    },
    {
      "title": "The Ocean and Cliffs",
      "caption": "This is a picture of the ocean and cliffs and stuff.",
      "imageurl": "https://images.unsplash.com/photo-1473210630848-e12656228f26?ixlib=rb-0.3.5&ixid=eyJhcHBfaWQiOjEyMDd9&s=920dcb42149dd2ec8e9d8207cfb32d41&auto=format&fit=crop&w=1432&q=80"
    }
  ],
  "articleText": "The scriptures were written to bless and encourage us, and surely they do that. We thank heaven for every chapter and verse we have ever been given. But have you noticed that every now and then a passage will appear that reminds us we are falling a little short? For example, the Sermon on the Mount begins with soothing, gentle beatitudes, but in the verses that follow, we are told—among other things—not only not to kill but also not even to be angry. We are told not only not to commit adultery but also not even to have impure thoughts. To those who ask for it, we are to give our coat and then give our cloak also. We are to love our enemies, bless those who curse us, and do good to them who hate us. If that is your morning scripture study, and after reading just that far you are pretty certain you are not going to get good marks on your gospel report card, then the final commandment in the chain is sure to finish the job: “Be ye therefore perfect, even as your Father … in heaven is perfect.”2 With that concluding imperative, we want to go back to bed and pull the covers over our head. Such celestial goals seem beyond our reach. Yet surely the Lord would never give us a commandment He knew we could not keep. Let’s see where this quandary takes us. Around the Church I hear many who struggle with this issue: “I am just not good enough.” “I fall so far short.” “I will never measure up.” \nI hear this from teenagers. I hear it from missionaries. I hear it from new converts. I hear it from lifelong members. One insightful Latter-day Saint, Sister Darla Isackson, has observed that Satan has somehow managed to make covenants and commandments seem like curses and condemnations. For some he has turned the ideals and inspiration of the gospel into self-loathing and misery-making."
}